app/controllers/v1/spins_controller.rb

    def index
      if params[:user_id]
        @user = User.find_by_github_login(params[:user_id])
        unless @user
          return_response status: :no_content
          return
        end
        @spins = Spin.where(user_id: @user.id, visible: true ) if @user
      else
        @spins = Spin.where(visible:true)
      end
      @spins = @spins.where('name like? or name like?', "%#{params[:query]}%", "%#{params[:query].downcase}%") if params[:query]
      if @spins.count.positive?
---
SELECT COUNT(*) FROM "spins" WHERE "spins"."visible" = $1  [["visible", "t"]]