app/controllers/v1/spin_candidates_controller.rb

SELECT COUNT(*) FROM "spin_candidates"
---
    def index
      @spins = SpinCandidate.where(user_id: current_user)
      @spins = @spins.where('name ILIKE ?', "%#{params[:query]}%") if params[:query]
      @spins = @spins.order("#{params[:sort]} #{params[:order] || 'DESC'}") if params[:sort]
      if @spins.count.positive?

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3019213], ["LIMIT", 1]]
---
    def refresh
      user = current_user.admin? ? User.find(params[:user_id]) : current_user

SELECT  "spin_candidates".* FROM "spin_candidates" WHERE "spin_candidates"."id" = $1 LIMIT $2  [["id", 120679426], ["LIMIT", 1]]
---
    def publish
      #puts "User is"+ current_user.inspect
      sc = SpinCandidate.find(params[:spin_candidate_id])