app/controllers/v1/users/sessions_controller.rb

      def create
        user = User.find_by(id: request.headers["X-USER-ID"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3019213], ["LIMIT", 1]]